layer {
  name: "data"
  type: "ImageData"
  top: "data"
  top: "label"
  include {
    phase: TEST
  }
  transform_param {
    scale: 0.00392156862745
    mirror: false
    crop_size: 32
    mean_value: 118
    mean_value: 114
    mean_value: 114
  }
  image_data_param {
    source: "./local_data/RTSD/gt_val.txt"
    batch_size: 128
    shuffle: true
    new_height: 40
    new_width: 40
    root_folder: "./local_data/RTSD/val/"
  }
}
layer {
  name: "BatchNorm1"
  type: "BatchNorm"
  bottom: "data"
  top: "BatchNorm1"
  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  name: "ReLU1"
  type: "ReLU"
  bottom: "BatchNorm1"
  top: "BatchNorm1"
  relu_param {
    engine: CAFFE
  }
}
layer {
  name: "conv1"
  type: "Convolution"
  bottom: "BatchNorm1"
  top: "conv1"
  convolution_param {
    num_output: 16
    pad: 1
    kernel_size: 3
    group: 1
    stride: 1
    weight_filler {
      type: "xavier"
    }
    engine: CAFFE
  }
}
layer {
  name: "conv2_shortcut"
  type: "Convolution"
  bottom: "conv1"
  top: "Convolution1"
  convolution_param {
    num_output: 32
    pad: 0
    kernel_size: 1
    group: 1
    stride: 1
    weight_filler {
      type: "xavier"
    }
    engine: CAFFE
  }
}
layer {
  name: "BatchNorm2"
  type: "BatchNorm"
  bottom: "conv1"
  top: "BatchNorm2"
  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  name: "ReLU2"
  type: "ReLU"
  bottom: "BatchNorm2"
  top: "BatchNorm2"
  relu_param {
    engine: CAFFE
  }
}
layer {
  name: "conv2_b1_c1"
  type: "Convolution"
  bottom: "BatchNorm2"
  top: "Convolution2"
  convolution_param {
    num_output: 32
    pad: 1
    kernel_size: 3
    group: 1
    stride: 1
    weight_filler {
      type: "xavier"
    }
    engine: CAFFE
  }
}
layer {
  name: "BatchNorm3"
  type: "BatchNorm"
  bottom: "Convolution2"
  top: "BatchNorm3"
  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  name: "ReLU3"
  type: "ReLU"
  bottom: "BatchNorm3"
  top: "BatchNorm3"
  relu_param {
    engine: CAFFE
  }
}
layer {
  name: "conv2_b1_c2"
  type: "Convolution"
  bottom: "BatchNorm3"
  top: "Convolution3"
  convolution_param {
    num_output: 32
    pad: 1
    kernel_size: 3
    group: 1
    stride: 1
    weight_filler {
      type: "xavier"
    }
    engine: CAFFE
  }
}
layer {
  name: "conv2_b1_sum"
  type: "Eltwise"
  bottom: "Convolution1"
  bottom: "Convolution3"
  top: "Eltwise1"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "BatchNorm4"
  type: "BatchNorm"
  bottom: "Eltwise1"
  top: "BatchNorm4"
  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  name: "ReLU4"
  type: "ReLU"
  bottom: "BatchNorm4"
  top: "BatchNorm4"
  relu_param {
    engine: CAFFE
  }
}
layer {
  name: "conv2_b2_c1"
  type: "Convolution"
  bottom: "BatchNorm4"
  top: "Convolution4"
  convolution_param {
    num_output: 32
    pad: 1
    kernel_size: 3
    group: 1
    stride: 1
    weight_filler {
      type: "xavier"
    }
    engine: CAFFE
  }
}
layer {
  name: "BatchNorm5"
  type: "BatchNorm"
  bottom: "Convolution4"
  top: "BatchNorm5"
  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  name: "ReLU5"
  type: "ReLU"
  bottom: "BatchNorm5"
  top: "BatchNorm5"
  relu_param {
    engine: CAFFE
  }
}
layer {
  name: "conv2_b2_c2"
  type: "Convolution"
  bottom: "BatchNorm5"
  top: "Convolution5"
  convolution_param {
    num_output: 32
    pad: 1
    kernel_size: 3
    group: 1
    stride: 1
    weight_filler {
      type: "xavier"
    }
    engine: CAFFE
  }
}
layer {
  name: "conv2_b2_sum"
  type: "Eltwise"
  bottom: "Eltwise1"
  bottom: "Convolution5"
  top: "conv2"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "conv3_shortcut"
  type: "Convolution"
  bottom: "conv2"
  top: "Convolution6"
  convolution_param {
    num_output: 64
    pad: 0
    kernel_size: 1
    group: 1
    stride: 2
    weight_filler {
      type: "xavier"
    }
    engine: CAFFE
  }
}
layer {
  name: "BatchNorm6"
  type: "BatchNorm"
  bottom: "conv2"
  top: "BatchNorm6"
  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  name: "ReLU6"
  type: "ReLU"
  bottom: "BatchNorm6"
  top: "BatchNorm6"
  relu_param {
    engine: CAFFE
  }
}
layer {
  name: "conv3_b1_c1"
  type: "Convolution"
  bottom: "BatchNorm6"
  top: "Convolution7"
  convolution_param {
    num_output: 64
    pad: 1
    kernel_size: 3
    group: 1
    stride: 2
    weight_filler {
      type: "xavier"
    }
    engine: CAFFE
  }
}
layer {
  name: "BatchNorm7"
  type: "BatchNorm"
  bottom: "Convolution7"
  top: "BatchNorm7"
  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  name: "ReLU7"
  type: "ReLU"
  bottom: "BatchNorm7"
  top: "BatchNorm7"
  relu_param {
    engine: CAFFE
  }
}
layer {
  name: "conv3_b1_c2"
  type: "Convolution"
  bottom: "BatchNorm7"
  top: "Convolution8"
  convolution_param {
    num_output: 64
    pad: 1
    kernel_size: 3
    group: 1
    stride: 1
    weight_filler {
      type: "xavier"
    }
    engine: CAFFE
  }
}
layer {
  name: "conv3_b1_sum"
  type: "Eltwise"
  bottom: "Convolution6"
  bottom: "Convolution8"
  top: "Eltwise2"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "BatchNorm8"
  type: "BatchNorm"
  bottom: "Eltwise2"
  top: "BatchNorm8"
  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  name: "ReLU8"
  type: "ReLU"
  bottom: "BatchNorm8"
  top: "BatchNorm8"
  relu_param {
    engine: CAFFE
  }
}
layer {
  name: "conv3_b2_c1"
  type: "Convolution"
  bottom: "BatchNorm8"
  top: "Convolution9"
  convolution_param {
    num_output: 64
    pad: 1
    kernel_size: 3
    group: 1
    stride: 1
    weight_filler {
      type: "xavier"
    }
    engine: CAFFE
  }
}
layer {
  name: "BatchNorm9"
  type: "BatchNorm"
  bottom: "Convolution9"
  top: "BatchNorm9"
  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  name: "ReLU9"
  type: "ReLU"
  bottom: "BatchNorm9"
  top: "BatchNorm9"
  relu_param {
    engine: CAFFE
  }
}
layer {
  name: "conv3_b2_c2"
  type: "Convolution"
  bottom: "BatchNorm9"
  top: "Convolution10"
  convolution_param {
    num_output: 64
    pad: 1
    kernel_size: 3
    group: 1
    stride: 1
    weight_filler {
      type: "xavier"
    }
    engine: CAFFE
  }
}
layer {
  name: "conv3_b2_sum"
  type: "Eltwise"
  bottom: "Eltwise2"
  bottom: "Convolution10"
  top: "conv3"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "conv4_shortcut"
  type: "Convolution"
  bottom: "conv3"
  top: "Convolution11"
  convolution_param {
    num_output: 128
    pad: 0
    kernel_size: 1
    group: 1
    stride: 2
    weight_filler {
      type: "xavier"
    }
    engine: CAFFE
  }
}
layer {
  name: "BatchNorm10"
  type: "BatchNorm"
  bottom: "conv3"
  top: "BatchNorm10"
  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  name: "ReLU10"
  type: "ReLU"
  bottom: "BatchNorm10"
  top: "BatchNorm10"
  relu_param {
    engine: CAFFE
  }
}
layer {
  name: "conv4_b1_c1"
  type: "Convolution"
  bottom: "BatchNorm10"
  top: "Convolution12"
  convolution_param {
    num_output: 128
    pad: 1
    kernel_size: 3
    group: 1
    stride: 2
    weight_filler {
      type: "xavier"
    }
    engine: CAFFE
  }
}
layer {
  name: "BatchNorm11"
  type: "BatchNorm"
  bottom: "Convolution12"
  top: "BatchNorm11"
  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  name: "ReLU11"
  type: "ReLU"
  bottom: "BatchNorm11"
  top: "BatchNorm11"
  relu_param {
    engine: CAFFE
  }
}
layer {
  name: "conv4_b1_c2"
  type: "Convolution"
  bottom: "BatchNorm11"
  top: "Convolution13"
  convolution_param {
    num_output: 128
    pad: 1
    kernel_size: 3
    group: 1
    stride: 1
    weight_filler {
      type: "xavier"
    }
    engine: CAFFE
  }
}
layer {
  name: "conv4_b1_sum"
  type: "Eltwise"
  bottom: "Convolution11"
  bottom: "Convolution13"
  top: "Eltwise3"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "BatchNorm12"
  type: "BatchNorm"
  bottom: "Eltwise3"
  top: "BatchNorm12"
  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  name: "ReLU12"
  type: "ReLU"
  bottom: "BatchNorm12"
  top: "BatchNorm12"
  relu_param {
    engine: CAFFE
  }
}
layer {
  name: "conv4_b2_c1"
  type: "Convolution"
  bottom: "BatchNorm12"
  top: "Convolution14"
  convolution_param {
    num_output: 128
    pad: 1
    kernel_size: 3
    group: 1
    stride: 1
    weight_filler {
      type: "xavier"
    }
    engine: CAFFE
  }
}
layer {
  name: "BatchNorm13"
  type: "BatchNorm"
  bottom: "Convolution14"
  top: "BatchNorm13"
  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  name: "ReLU13"
  type: "ReLU"
  bottom: "BatchNorm13"
  top: "BatchNorm13"
  relu_param {
    engine: CAFFE
  }
}
layer {
  name: "conv4_b2_c2"
  type: "Convolution"
  bottom: "BatchNorm13"
  top: "Convolution15"
  convolution_param {
    num_output: 128
    pad: 1
    kernel_size: 3
    group: 1
    stride: 1
    weight_filler {
      type: "xavier"
    }
    engine: CAFFE
  }
}
layer {
  name: "conv4_b2_sum"
  type: "Eltwise"
  bottom: "Eltwise3"
  bottom: "Convolution15"
  top: "conv4"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "BatchNorm14"
  type: "BatchNorm"
  bottom: "conv4"
  top: "BatchNorm14"
  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  name: "ReLU14"
  type: "ReLU"
  bottom: "BatchNorm14"
  top: "BatchNorm14"
}
layer {
  name: "avg_pool"
  type: "Pooling"
  bottom: "BatchNorm14"
  top: "avg_pool"
  pooling_param {
    kernel_size: 8
    stride: 1
  }
}
layer {
  name: "fc"
  type: "InnerProduct"
  bottom: "avg_pool"
  top: "fc"
  inner_product_param {
    num_output: 51
    weight_filler {
      type: "xavier"
    }
  }
}
layer {
  name: "softmax"
  type: "Softmax"
  bottom: "fc"
  top: "softmax"
  softmax_param {
    engine: CAFFE
  }
}
layer {
  name: "loss"
  type: "MultinomialLogisticLoss"
  bottom: "softmax"
  bottom: "label"
  top: "loss"
}
layer {
  name: "accuracy_1"
  type: "Accuracy"
  bottom: "softmax"
  bottom: "label"
  top: "accuracy_1"
  accuracy_param {
    top_k: 1
  }
}
layer {
  name: "accuracy_5"
  type: "Accuracy"
  bottom: "softmax"
  bottom: "label"
  top: "accuracy_5"
  accuracy_param {
    top_k: 5
  }
}
